parameters_ranges = {
    "Геометричні параметри":{
    "1.Кількість поверхів": {
        1: range(1, 3),
        2: range(3, 6),
        3: range(6, 10),
        4: range(10, 15),
        5: range(15, float('inf'))  # для представлення "більше 15"
    },
    "2.Висота будівлі": {
        1: range(1, 11),
        2: range(11, 16),
        3: range(16, 31),
        4: range(31, 61),
        5: range(61, float('inf'))  # для представлення "більше 60"
    },
    # Для параметра "Форма будівлі" будемо використовувати список, оскільки це не числові значення
    "3.Форма будівлі": {
        1: "1)Прямокутна",
        2: "2)Квадратна",
        3: "3)Округла",
        4: "4)Складна"
    },
    "4.Площа забудови": {
    1: range(1, 101),
    2: range(300, 501),
    3: range(600, 1201),
    4: range(1300, 2001),
    5: range(2001, 999999)  # Використовуємо велике число для представлення "більше 2000"
},
    "5.Висота до підкранового шляху": {
    1: "1)немає(Цивільна)",
    2: "2)До 5м",
    3: "3)5-10м",
    4: "4)10-15м",
    5: "5)більше 15м" # Використовуємо велике число для представлення "более 15"
},
    "6.Ширина прольоту (середня)": {
    1: "Немає",
    2: range(1, 10),
    3: range(9, 16),
    4: range(18, 31),
    5: range(30, 42)
}
    },
    "Параметри по типам": {
        "7.Тип будівлі":{
    1: "1)Житлове",
    2: "2)Адміністративне",
    3: "3)Громадське",
    4: "4)Промислове",
    5: "5)Інше"
    },
    "8.Конструктивна схема":{
    1: "1)Безкаркасне",
    2: "2)Каркасне",
    3: "3)Неповний каркас"
    },
    "9.Капітальність будівлі":{
    1: "1)I",
    2: "2)II",
    3: "3)III",
    4: "4)IV",
    5: "5)V-VI"
    },
    "10.Тип перекриття":{
    1: "Монолітне",
    2: "1)Збірне ребристе",
    3: "2)Збірне круглопустотне",
    4: "3)Металеве",
    5: "4)Поєднане"
     },
    "11.Матеріал несучих конструкцій": {
    1: "1)Бетон",
    2: "2)Залізобетон",
    3: "3)Метал",
    4: "4)Камінь",
    5: "5)Поєднане"
},
    "12.Метод виготовлення ЗБ конструкцій": {
    1: "1)Монолітний",
    2: "2)Збірний",
    3: "3)Немає"
},
    "13.Рік побудови": {
    1: "Немає",
    2: range(1900, 1919),
    3: range(1920, 1949),
    4: range(1950, 1979),
    5: range(1980, 2020)
},
    "14.Клас наслідків":{
    1: "1)CC1",
    2: "2)CC2",
    3: "3)CC3",
},
},
    "Параметри майданчику": {
    "15.Грунти на яких побудований об'єкт": {
    1: "1)Скальні",
    2: "2)Глинисті",
    3: "3)Суглинисті",
    4: "4)Супіщяні",
    5: "5)Піщяні/насипні"
},
    "16.Необхідність додаткового закріплення грунту": {
    1: "1)Забивка шпунта",
    2: "2)Віброзанурення",
    3: "3)Залізобетонні палі(підпірна стінка)",
    4: "4)Немає"
},
    "17.Відстань від дротів ЛЕП": {
    1: "1)Немає",
    2: "2)1-5м",
    3: "3)5-15м",
    4: "4)15-40"
},
    "18.Відстань від залізничних рельсів": {
    1: "1)Немає",
    2: "2)1-5м",
    3: "3)5-15м",
    4: "4)15-40"
},
    "19.Наявність перевищення норм радіації": {
    1: False,
    2: True
},
    "20.Необхідність погодження проекту зі спец. службами": {
    1: "1)Немає ",
    2: "2)Так(водоканал)",
    3: "3)Так(газова служба)",
    4: "4)Так(Электромережі)",
    5: "5)Так(екологія)"
},
    "21.Використання спеціалізованих норм на виробництві:": {
    1: "1)Домене, конвертерне",
    2: "2)Газове, коксове",
    3: "3)Листопорокатне\трубопрокатне",
    4: "4)Рудозбагачувальне",
    5: "5)Немає"
},
"22.Наявність перевищення норм радіації": {
    1: False,
    2: True
},
}
}

